In [1]:
# imports
import pandas as pd
from sqlalchemy import create_engine
from login_details import username
from login_details import password

## Storing CSVs as DataFrames

In [2]:
#01
electoral_division_df = pd.read_csv("01-output_electoral_division/electoral_division.csv")
electoral_division_df.head()

   division_id electoral_division state
0          179           Adelaide    SA
1          197              Aston   VIC
2          198           Ballarat   VIC
3          103              Banks   NSW
4          180             Barker    SA

In [3]:
#02
election_results_df = pd.read_csv("02-output_election_results/02-election_results.csv")
election_results_df.head()

,division_id,enrolment,demographic,previous_party,previous_seat_status,successful_party,seat_status
0,179,109217,Inner Metropolitan,Australian Labor Party,Marginal,Australian Labor Party,Marginal
1,197,96043,Outer Metropolitan,Liberal,Fairly Safe,Liberal,Fairly Safe
2,198,110755,Provincial,Australian Labor Party,Marginal,Australian Labor Party,Fairly Safe
3,103,104891,Inner Metropolitan,Liberal,Marginal,Liberal,Marginal
4,180,105600,Rural,Liberal,Safe,Liberal,Marginal

In [4]:
#03
election_vote_types_df = pd.read_csv("03-output_election_vote_types/election_vote_types.csv")
election_vote_types_df.head()

,division_id,ordinary_votes,absent_votes,provisional_votes,prepoll_votes,postal_votes,total_votes
0,179,79148,6869,686,3444,8515,98662
1,197,72395,3756,292,3090,9578,89111
2,198,87377,3439,783,3118,8451,103168
3,103,81420,4109,469,3395,7095,96488
4,180,85870,3019,245,2877,6662,98673

In [50]:
#04
election_turnout_df = pd.read_csv("04-ouput_election_turnout/election_turnout.csv")
#election_turnout_df.columns['division_id', 'total_enrolled', 'total_votes', 'turnout_percentage']
election_turnout_df.head()

   division_id  total_enrolled  total_votes  turnout(%)
0          179          109217        98662        90.3
1          197           96043        89111        92.8
2          198          110755       103168        93.2
3          103          104891        96488        92.0
4          180          105600        98673        93.4

In [73]:
election_turnout_df.columns = ['division_id', 'total_enrolled', 'total_votes', 'turnout_percentage']
election_turnout_df.head()

   division_id  total_enrolled  total_votes  turnout_percentage
0          179          109217        98662                90.3
1          197           96043        89111                92.8
2          198          110755       103168                93.2
3          103          104891        96488                92.0
4          180          105600        98673                93.4

In [6]:
#05
marriage_postal_results_df = pd.read_csv("05-output_marriage_postal_results/marriage_postal_results.csv")
marriage_postal_results_df.head()

,division_id,yes_count,no_count,total_responses,response_unclear,non_responding
0,103,37736,46343,84079,247,20928
1,104,37153,47984,85137,226,24008
2,105,42943,43215,86158,244,19973
3,106,48471,40369,88840,212,16038
4,107,20406,57926,78332,220,25883

In [58]:
#06
marriage_postal_turnout_df = pd.read_csv("06-output_marriage_postal_turnout/marriage_postal_turnout.csv")
marriage_postal_turnout_df.columns = ['division_id', 'total_eligible', 'total_participants', 'turnout_percent']
marriage_postal_turnout_df.head()

   division_id  total_eligible  total_participants  turnout_percent
0          179          108708               88422             81.3
1          197           95253               77706             81.6
2          198          113368               92583             81.7
3          103          104682               83846             80.1
4          180          105297               81124             77.0

In [68]:
#07
marriage_postal_participants_by_age_df = pd.read_csv("07-output_marriage_postal_participants_by_age/marriage_postal_participants_by_age.csv")
marriage_postal_participants_by_age_df.columns = ['division_id', 'ages_18-34', 'ages_35-49', 'ages_50-64', 'ages_65-79', 'ages_80_plus']

marriage_postal_participants_by_age_df.head()

   division_id  ages_18-34  ages_35-49  ages_50-64  ages_65-79  ages_80_plus
0          179       24474       20770       22353       15429          5396
1          197       20745       18667       21236       13420          3638
2          198       22345       22008       24709       18264          5257
3          103       20562       20416       22008       14571          6289
4          180       14079       16493       24109       20212          6231

In [81]:
#08
population_agedemo_2017_df = pd.read_csv("08-output_2017_population_agedemo/08-2017_population_agedemo.csv")
population_agedemo_2017_df.columns = ['division_id', '0-17_percent', '18-34_percent', '35-49_percent', '50-64_percent', '65-79_percent', '80+_percent', 'pop_count_est']
population_agedemo_2017_df.head()

,division_id,0-17_percent,18-34_percent,35-49_percent,50-64_percent,65-79_percent,80+_percent,pop_count_est
0,179,17.9,31.3,19.5,16.6,10.2,4.5,188410
1,197,21.5,23.4,20.5,19.3,11.5,3.8,161813
2,198,23.1,22.0,18.9,18.8,13.0,4.2,154461
3,103,21.0,25.3,19.7,18.2,10.8,4.9,164403
4,180,22.1,18.7,18.3,21.0,15.0,4.9,171058

In [87]:
#09
cultural_diversity_df = pd.read_csv("09-output_cultural_diversity/09-cultural_diversity.csv")
cultural_diversity_df.columns = ['division_id', 'aboriginal_torres_strait_percent', 'born_overseas_percent', 'recent_migrants_percent', 'different_language_percent']
cultural_diversity_df.head()

,division_id,aboriginal_torres_strait_percent,born_overseas_percent,recent_migrants_percent,different_language_percent
0,179,1.2,35.0,17.6,34.6
1,197,0.5,30.2,8.8,25.2
2,198,1.3,10.5,3.0,5.3
3,103,0.8,38.9,12.8,45.2
4,180,2.5,10.9,3.2,5.7

In [35]:
#10
education_df = pd.read_csv("10-output_education/10-education.csv")
education_df.columns = ['division_id', 'year_12_completion_percent', 'higher_education_completion_percent']
education_df.head()

,division_id,year_12_completion_percent,higher_education_completion_percent
0,179,82.4,49.3
1,197,79.7,49.3
2,198,68.6,45.1
3,103,83.4,47.8
4,180,57.9,34.9

## Connecting to database

*Create database and tables with schema.sql*
Database is called project_db

In [88]:
# Connecting to local database
# using username and password imported above

rds_connection_string = f"{username}:{password}@localhost:5432/project_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

## Checking tables in the databate

In [89]:
engine.table_names()

['electoral_division',
 'election_results',
 'election_vote_types',
 'marriage_postal_results',
 'marriage_postal_participants_by_age',
 '2017_population_agedemo',
 'education',
 'marriage_postal_turnout',
 'cultural_diversity',
 'election_turnout']

## Loading DataFrames into database

In [14]:
#01
electoral_division_df.to_sql(name='electoral_division', con=engine, if_exists='append', index=False)

In [15]:
#02
election_results_df.to_sql(name='election_results', con=engine, if_exists='append', index=False)

In [16]:
#03
election_vote_types_df.to_sql(name='election_vote_types', con=engine, if_exists='append', index=False)

In [74]:
#04
election_turnout_df.to_sql(name='election_turnout', con=engine, if_exists='append', index=False)

In [19]:
#05 
marriage_postal_results_df.to_sql(name='marriage_postal_results', con=engine, if_exists='append', index=False)

In [61]:
#06
marriage_postal_turnout_df.to_sql(name='marriage_postal_turnout', con=engine, if_exists='append', index=False)

In [69]:
#07
marriage_postal_participants_by_age_df.to_sql(name='marriage_postal_participants_by_age', 
                                              con=engine, if_exists='append', index=False)

In [84]:
#08
population_agedemo_2017_df.to_sql(name='2017_population_agedemo', con=engine, if_exists='append', index=False)

In [90]:
#09
cultural_diversity_df.to_sql(name='cultural_diversity', con=engine, if_exists='append', index=False)

In [39]:
#10
education_df.to_sql(name='education', con=engine, if_exists='append', index=False)

## Confirm data has been added by querying tables

In [26]:
#01
pd.read_sql_query('select * from electoral_division', con=engine).head()

   division_id electoral_division state
0          179           Adelaide    SA
1          197              Aston   VIC
2          198           Ballarat   VIC
3          103              Banks   NSW
4          180             Barker    SA

In [45]:
#02
pd.read_sql_query('select * from election_results', con=engine).head()

,division_id,enrolment,demographic,previous_party,previous_seat_status,successful_party,seat_status
0,179,109217,Inner Metropolitan,Australian Labor Party,Marginal,Australian Labor Party,Marginal
1,197,96043,Outer Metropolitan,Liberal,Fairly Safe,Liberal,Fairly Safe
2,198,110755,Provincial,Australian Labor Party,Marginal,Australian Labor Party,Fairly Safe
3,103,104891,Inner Metropolitan,Liberal,Marginal,Liberal,Marginal
4,180,105600,Rural,Liberal,Safe,Liberal,Marginal

In [46]:
#03 
pd.read_sql_query('select * from election_vote_types', con=engine).head()

,division_id,ordinary_votes,absent_votes,provisional_votes,prepoll_votes,postal_votes,total_votes
0,179,79148,6869,686,3444,8515,98662
1,197,72395,3756,292,3090,9578,89111
2,198,87377,3439,783,3118,8451,103168
3,103,81420,4109,469,3395,7095,96488
4,180,85870,3019,245,2877,6662,98673

In [75]:
#04
 
pd.read_sql_query('select * from election_turnout', con=engine).head()

   division_id  total_enrolled  total_votes  turnout_percentage
0          179          109217        98662                90.3
1          197           96043        89111                92.8
2          198          110755       103168                93.2
3          103          104891        96488                92.0
4          180          105600        98673                93.4

In [47]:
#05
pd.read_sql_query('select * from marriage_postal_results', con=engine).head()

,division_id,yes_count,no_count,total_responses,response_unclear,non_responding
0,103,37736,46343,84079,247,20928
1,104,37153,47984,85137,226,24008
2,105,42943,43215,86158,244,19973
3,106,48471,40369,88840,212,16038
4,107,20406,57926,78332,220,25883

In [62]:
#06

pd.read_sql_query('select * from marriage_postal_turnout', con=engine).head()

   division_id  total_eligible  total_participants  turnout_percent
0          179          108708               88422             81.3
1          197           95253               77706             81.6
2          198          113368               92583             81.7
3          103          104682               83846             80.1
4          180          105297               81124             77.0

In [70]:
# 07
# changed ages_80_plus
pd.read_sql_query('select * from marriage_postal_participants_by_age', con=engine).head()

   division_id  ages_18-34  ages_35-49  ages_50-64  ages_65-79  ages_80_plus
0          179       24474       20770       22353       15429          5396
1          197       20745       18667       21236       13420          3638
2          198       22345       22008       24709       18264          5257
3          103       20562       20416       22008       14571          6289
4          180       14079       16493       24109       20212          6231

In [86]:
#08

pd.read_sql_query('select * from "2017_population_agedemo"', con=engine).head()

,division_id,0-17_percent,18-34_percent,35-49_percent,50-64_percent,65-79_percent,80+_percent,pop_count_est
0,179,17.9,31.3,19.5,16.6,10.2,4.5,188410
1,197,21.5,23.4,20.5,19.3,11.5,3.8,161813
2,198,23.1,22.0,18.9,18.8,13.0,4.2,154461
3,103,21.0,25.3,19.7,18.2,10.8,4.9,164403
4,180,22.1,18.7,18.3,21.0,15.0,4.9,171058

In [91]:
#09

pd.read_sql_query('select * from cultural_diversity', con=engine).head()

,division_id,aboriginal_torres_strait_percent,born_overseas_percent,recent_migrants_percent,different_language_percent
0,179,1.2,35.0,17.6,34.6
1,197,0.5,30.2,8.8,25.2
2,198,1.3,10.5,3.0,5.3
3,103,0.8,38.9,12.8,45.2
4,180,2.5,10.9,3.2,5.7

In [48]:
#10

pd.read_sql_query('select * from education', con=engine).head()

,division_id,year_12_completion_percent,higher_education_completion_percent
0,179,82.4,49.3
1,197,79.7,49.3
2,198,68.6,45.1
3,103,83.4,47.8
4,180,57.9,34.9